// Створіть змінну з ім'ям name і присвойте їй ваше ім'я. Виведіть це ім'я в консоль.

//const name = "Вероніка";
//console.log (name);

// Створіть змінну age і присвойте їй ваш вік. Виведіть в консоль рядок, що містить ваш вік у такому форматі: "Мені {вік} років".

//const age = 38;
//console.log (`Мені ${age} років`);

// Створіть змінні x і y і присвойте їм довільні числа. Виведіть в консоль результати додавання, віднімання, множення та ділення цих чисел.

//const x = 10;
//const y = 40;
//console.log (x+y);
//console.log (y-x);
//console.log (x*y);
//console.log (y/x);

// Створіть змінну city і присвойте їй назву вашого міста. Створіть рядок, який містить "Я живу в місті {назва міста}", і виведіть його в консоль.

//const city = "Riga"
//console.log(`Я живу в місті ${city}`);

// Створіть рядок з вашою електронною поштою. Використайте методи рядка, щоб витягнути ваше ім'я та доменну частину. Виведіть обидва ці значення в консоль.

//const mail = "artemova331@gmail.com";
//console.log(mail.replace('@gmail.com', ''));
//console.log(mail.replace('artemova331@', ''));

// Створіть змінну price і присвойте їй число. Створіть рядок, що містить ціну з символом гривні, наприклад: "Ціна: 500 грн". 

//const price = 25;
//const messendge = `Ціна: ${price} грн`;
//console.log (messendge);








